Revit API Introduction Labs
LabUtils.GetProjectInfoElem Method
 Return the one and only project information element by searching for the "Project Information" category. Only one such element exists.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static Element GetProjectInfoElem(
	Document doc
)
Visual Basic (Declaration)
Public Shared Function GetProjectInfoElem ( _
	doc As Document _
) As Element
Visual C++
public:
static Element^ GetProjectInfoElem(
	Document^ doc
)
Parameters
doc
Type: Document
See Also
LabUtils Class
Labs Namespace